const id = 'time';
const title = 'Create Time in universe';

const steps = [
    {
        text: `
            Ну що ти готовий почати створювати час всесвіту? Ні??? Тоді не займай мій час, Ширшавий гівнюк. А 
            якщо готовий слухай сюди... 
        `
    },
    {
        text: `
            Для початку створимо функцю <br><code>time() { console.log('tick'); }</code>, її потрібно якосю викликати тому пропоную 
            зробити це наступним чином: <code>setInterval(time, 1000) </code>
        `
    },
    {
        text: `
            Перевір що в тебе в <code>console.log</code> показує <code>tick</code> кожну секунду....ушлепок 
        `
    },
    {
        text: `
            Охереть Шершавий в тебе вийшло.... Гигиги мабуть.....
        `
    },
    {
        text: `
           Тобі мабуть цікаво накх.кхкхккх нам той час..., 
           А ось нашо: Рух є зміна Позиції з Часом 
        `
    },
    {
        text: `
           Нам потрібно в нашій фрукції тайм змінювати <code>mars.x += 1</code> Давай швидше, не затримуй мене, я 
           й так маю купу справ.
        `
    },
    {
        text: `
         І що вийшло? Опоп оп оп і ніхуя......
        `
    },
    {
        text: `
         А чого ? не віроно....
         треба просто ще сказати щоб воно нам це малювало кожну секунду, тіки не питай як.... тиж Ширшавий типу УмНій
        `
    },
    {
        text: `
        
        `
    },
    
];

export const chapterTime = {
    id,
    title,
    steps,
  }